---
type: ConduitSizeSettings
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 11
tags: [revit-api, class]
---

# ConduitSizeSettings

`Autodesk.Revit.DB.Electrical.ConduitSizeSettings` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddSize | 2017 | `public void AddSize ( string standardName , ConduitSize sizeInfo )` |
| Method | CreateConduitStandardTypeFromExisingStandardType | 2017 | `public bool CreateConduitStandardTypeFromExisingStandardType ( Document pADoc , string newStandardName , string existingStandardName )` |
| Method | DoesConduitStandardTypeExist | 2017 | `public bool DoesConduitStandardTypeExist ( string standardName )` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetConduitSizeSettings | 2017 | `public static ConduitSizeSettings GetConduitSizeSettings ( Document aDoc )` |
| Method | GetConduitSizeSettingsIterator | 2017 | `public ConduitSizeSettingIterator GetConduitSizeSettingsIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator < KeyValuePair < string , ConduitSizes >> GetEnumerator ()` |
| Method | GetSizeCount | 2017 | `public int GetSizeCount ( string standardName )` |
| Method | RemoveConduitStandardType | 2017 | `public bool RemoveConduitStandardType ( Document pADoc , string standardName )` |
| Method | RemoveSize | 2017 | `public void RemoveSize ( string standardName , double nominalDiameter )` |
| Property | Parameter | — | `` |